app/controllers/restaurants_controller.rb

    def index
        restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
        restaurant = Restaurant.find_by(id: params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        restaurant = Restaurant.find_by(id: params[:id])

        if restaurant
            restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]