app/controllers/restaurant_pizzas_controller.rb

INSERT INTO "restaurant_pizzas" ("price", "pizza_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 20], ["pizza_id", 1], ["restaurant_id", 3], ["created_at", "2023-06-26 09:15:00.848539"], ["updated_at", "2023-06-26 09:15:00.848539"]]
---
    def create
        restaurant_pizza = RestaurantPizza.new(restaurant_pizza_params)

        if restaurant_pizza.save